package chinese

import (
	"testing"
)

func TestSimplized(t *testing.T) {
	str := Simplized(`曆史的謊言

事是由人做的，話是由人說的。
千年的曆史底蘊所促成的不是人格的升華，而是一種沒落；謊言是由卑劣編織的，而良知卻在喪失。國家的曆史，從某方麵來說，就是群體的曆史，而群體卻由少數的偽善者操縱。

我們很慶幸，我們還有曆史，為此，我們而驕傲，而沾沾自喜。但所不幸的是，曆史也是有謊言的。我們沉迷於奢華的個人追求，我們享受於靡醉的向往，但我們卻在不知不覺中沉淪。大我似乎已變得渺小不堪，而小我卻在肆無忌憚。 真相，是不為所知的，要是都知道了，更談何什麼秘密。為了某種利益，作為個人，我們都曾用謊言來偽裝，但偽裝的結果隨著時間的推移，會變得模糊不清。

我們都知道，謊言說過一百遍之後，就會成為真理。曆史，在某一特定階段，是需要謊言的，無有謊言的曆史，談不上真正的曆史。崇高的理想和追求不外乎是美麗的欺騙，燦爛的光環始終在陽光的照射下變得灰暗，然而，我們為這灰暗而喝彩。

謊言是一切卑鄙者和軟弱者的行為，也是一切陰暗物所共有的特點。真實的曆史，隻是一種人為的點綴，虛名的花環總有凋零的黃昏。曆史也許是可以容忍的，就是它真的在說謊話；而最怕的，而最不能容忍的，卻是我們的麻木和愚鈍。當然，醜陋的事我們是不願意承認的，更不願檢討，就象人一樣，知道自己的大糞本為肮髒之物，所以，必須關起廁所的門。

我們崇尚於我們的燦爛文化，我們膜拜於我們光輝的曆史，在一種不可抗拒的力量的作用下，我們忽然發覺，我們已沒有了自己的思想。曆史，的確是殘酷的，而真理卻在退縮。

好聽的話，我們都百聽不厭其煩，冠冕堂皇的曆史，也足以讓我們驕傲一生，就是真的藏垢納汙，那也是我們不願提及的。我們自恃為聰明，但我們真的忽視了自己的愚笨，無有個性和思想的人，隻配做動物。就象那被耍的猴子，讓它跪它跪著，讓它頭頂著磚，它頂著；過後呢？還要用繩子拴著。

真話是很難說的，說了真話的人，隻能讓其他的人恥笑；真理的道路是艱辛的，在真理的麵前，謬誤耀武揚威。我們都不願意過早的清醒，我們都習慣於閉起雙眼，有那麼幾個敢睜眼的，卻被整個的社會所遺棄，所抹殺，直至過多的人投來冷眼和諷刺。

曆史是會裝腔作勢的，它不停的繞著彎子，在眾口鑠金之中，它變成了陽萎。 我們很難逃避這個社會對我們的影響和束縛，我們在曆史的熏陶之下，都聰明的領悟到了生存之道。為自己的謊言而問心無愧，為自己的卑劣行徑而得意洋洋，殊不知，曆史終究有它清醒的時候，當它真的清醒之時，我們會發現曆史也會象《皇帝的新裝》上的那個小孩子，大喊著：他身上什麼也沒有穿！

為此，我為那少數的睜開眼的人及追求真理的人而驕傲，更為那眾多的閉著眼的人及還未清醒的人而羞愧，而悲哀！

The roses are in bloom; some are red and some yellow.
`)

	print(str)

}
